In [61]:
import pandas as pd

df = pd.read_csv("day_one_input.csv", names=["list_1","list_2"], sep= "   ")

C:\Users\allen\AppData\Local\Temp\ipykernel_17528\4278398933.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv("day_one_input.csv", names=["list_1","list_2"], sep= "   ")

In [37]:
df.head()

   list_1  list_2
0   60236   87497
1   27507   18604
2   69810   73952
3   60448   56269
4   92139   61722

In [48]:
df["list_1"] = df["list_1"].sort_values(ascending=True).values
df["list_2"] = df["list_2"].sort_values(ascending=True).values

In [49]:
df

     list_1  list_2
0     10042   10260
1     10055   10289
2     10140   10414
3     10215   10905
4     10312   10924
..      ...     ...
995   99400   99400
996   99474   99400
997   99741   99459
998   99917   99584
999   99974   99676

[1000 rows x 2 columns]

In [54]:
df["dist"] = abs(df["list_1"] - df["list_2"])

In [55]:
sum(df["dist"])

1506483

In [ ]:
# onto part 2 of day 1

In [57]:
sim_score = 0

In [58]:
for i in df["list_1"]:
    num_occur = 0
    for j in df["list_2"]:
        if i == j:
            num_occur += 1
    sim_score += i*num_occur

In [59]:
sim_score

23126924